shubham030/moth/moth_render/esp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_HZ=1000
